tutorials/combustion/XiFoam/les/pitzDaily/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue b 1
    volScalarFieldValue T 293
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (1 0 1);
        fieldValues
        (
            volScalarFieldValue b 0
            volScalarFieldValue T 1650
        );
    }
);


// ************************************************************************* //
